import matplotlib.pyplot as plt

# データの定義
x = [0.04 * i for i in range(1, 13)]  # [0.02, 0.04, ..., 0.2]

x_name = ["RAW", "HAMMING", "ILH"]

err = [
    [0, 0, 0, 0, 3.15696e-05, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
]

fdp = [
    [0.000787402, 0.000545086, 0.00072584, 0.000468658, 0.000536396, 0.000445656, 0.000780292, 0.000555445, 0.000540948, 0.000737048, 0.000599926, 0.000577968],
    [0.000305437, 0.00078284, 0.00112809, 0.00102318, 0.0011498, 0.000856929, 0.00074845, 0.0012364, 0.000951676, 0.00114938, 0.00113997, 0.00100057],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
]

gad = [
    [8.84542, 10.6045, 13.2753, 16.6886, 21.9582, 32.6013, 66.9914, 1010.45, 5106.42, 9358.1, 12942.4, 16277.9],
    [12.4732, 20.773, 45.9961, 174.743, 5455.24, 13161.9, 18624.2, 22208.3, 25586.4, 28050.2, 30119, 31901.9],
    [12.4274, 20.9678, 43.4113, 250.485, 6094.67, 13640.6, 18246.5, 22122.1, 25709.7, 27930, 29688.2, 31898.8]
]

nt = [
    [0.508051, 1.02726, 1.5433, 2.04742, 2.53564, 3.05198, 3.59057, 4.03515, 4.14378, 4.12731, 4.13824, 4.15457],
    [0.91704, 1.78967, 2.7369, 3.56601, 3.90563, 3.92696, 3.93483, 3.97169, 3.9767, 3.90413, 3.93207, 3.91965],
    [0.898838, 1.78859, 2.71399, 3.60136, 3.92871, 3.9232, 3.95584, 3.92218, 3.94453, 3.94306, 3.94188, 3.9396]
]

# プロットの作成
fig, axes = plt.subplots(1, 2, figsize=(16, 6), sharex=True, sharey=False)

plt.suptitle("delay and through put")

# グラフ1の描画
for idx, series in enumerate(gad, start=0):
    axes[0].plot(x, series, marker='o', label=x_name[idx])
axes[0].set_xlabel('global average delay (cycles)')
axes[0].set_ylabel('average delay')
axes[0].set_ylim(bottom=0,top=1000)
axes[0].legend()
axes[0].grid(True)

# グラフ2の描画
for idx, series in enumerate(nt, start=0):
    axes[1].plot(x, series, marker='o', label=x_name[idx])
axes[1].set_xlabel('Network throughput (flits/cycle)')
axes[1].set_ylabel('through put')
axes[1].legend()
axes[1].grid(True)


# レイアウトの調整
plt.tight_layout(rect=[0, 0.03, 1, 0.95]) 

# グラフの表示
plt.show()
